#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"南北朝", "start_time_AD":420, "pass_time_AD":589, "story":'''
南北朝（420年—589年）是南朝和北朝的合称，不是历史朝代，是中国历史上的一段大分裂和民族大融合时期
上承东晋十六国下接隋朝，由420年刘裕代东晋建立刘宋始，至公元589年隋灭陈而终。
南朝包含刘宋、南齐、南梁、南陈四朝；北朝则包含北魏、东魏、西魏、北齐和北周五朝。
南北两方虽各有朝代更迭，但长期维持对峙形势，故称为南北朝。
南朝作为汉族政权和东晋的延续，北朝承继五胡十六国，为胡汉融合的朝代。
北魏皇室多为鲜卑族。而鲜卑皇室也逐渐受到汉文化的熏陶，其中以北魏孝文帝的汉化运动最盛。
从西晋到隋朝的建立，中间大概有三百多年的时间，这一时期各少数民族逐鹿中原，中国呈现出了大分裂再到大一统，最终完成了民族融合。
''', "color":"#808080"}
