data_dict = {"name":"启示录", "start_time_AD":90, "pass_time":1, "story":'''
流放约翰 拔摩海岛 达信教会 七灯台 七教会 七星 其七使者 [以弗所 士每拿 别迦摩 推雅推喇
撒狄 非拉铁非 老底嘉] 书卷七印 羔羊来拿 新歌赞美 第七印 天寂二刻 七使七号
力使天降 拿小书卷 呼喊 七雷封 右手举 宣言 七号发声 奥秘成全 吩咐取卷 吃甜肚苦
两见证人 橄榄灯台 传道1260天 作完见证 兽战胜杀 观尸三天半 人喜送礼 生气入站
天声召 驾云上天 地震 城塌1/10 死7千人 第七号 天声说 世国成主国 作王永远 
天殿开 约柜现 电声雷震雹 天现异象 [妇人 日月12星 怀孕 红龙 7头10角7冕 尾拖1/3星
摔地 站等吃 生男被提 妇逃旷野 1260天 天战 龙败摔地 逼迫妇人 赐翅旷野 一二半载
蛇吐水 地帮 龙怒战裔] 海兽上 龙给 一头死医 全地拜俩 任行42月 非册都拜 [掳人被掳
杀人被杀 圣徒忍耐 信心 在此] 地兽上 羊角龙话 行一兽行 叫拜一 行大奇 作一像
有气能说 不拜杀 众人受印 右手或额 除印兽数 不得买卖 兽数人数 六六六 羔羊锡安 144000
他名父名 写在额上 新歌 仅买之人 白云人子 金冕快镰 喊收庄稼 又一拿镰 喊收葡萄
忿怒酒醡 血流600里 天又异象 玻璃海火 胜兽人站 神琴唱歌 存柜殿开 七使出 给七碗 说倒地
第六碗 伯拉河干 龙兽假先知 口三污灵出 聚众王 [儆醒 看守衣服 免赤羞耻 有福了] 第七碗
成了之声 电声雷震 大城裂三 列国城塌 海岛逃避 众山不见 大雹落 圣灵感动 天使带 旷野
女人骑兽 7头10角 额巴比伦 [争战 羔羊必胜 同着得胜 十角兽恨 冷落 吃肉 烧尽 神使
诸王同心 遵他旨意 国给兽 至神话应 女人大城 管辖众王] 天使降喊 大城终局 奢华 船海富人
城荒众悲 众圣欢喜 天上赞美 欢喜快乐 俯拜不可 同是仆人 要敬拜神 天开 白马骑士 众军跟
利剑口出 击打列国 铁杖辖管 天使喊鸟 兽王军聚 兽假先知 同被拿扔 其余剑杀 捉龙捆 扔坑封
首活同王 至千年 放撒旦迷惑 歌革玛各 聚集争战 围圣徒处 火降灭 迷惑者 扔火湖 白色大宝座
天地逃避 死人受审 案卷生命册 照行审判 死亡阴间 扔在火湖 册无扔湖 新天新地 新耶城降
神人同住 即听看见 要拜天使 千万不可 同是仆人 要敬拜神 不可封 日期近
耶稣快来 书上预言 不可增删 主必快来 主耶稣啊 我愿你来 '''}
