#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典2019-2020", "start_time_AD":2019, "pass_time_AD":2020, "story":'''
2019高神大  26韩国釜山
2019年初走完了手续进入了高神大读M.Div
自以为义的心态奉献，加上教会主动要奉献，陷入了极度的艰难。
拉面是吃不起的，每天挂面-中国产大萝卜，好的话有个鸡蛋。
从早上6点到晚上10点呆图书馆。脖子/肩膀/腰伤损加重。
压力过大，伤了胃肠。由此生病过一次，以为要死了
教会有个人给的什么药，吃了。这病虽疼痛，却没有让我死亡。
神在这其中，也充满善意的恩典。
中间试过寻求下在韩国呆了十年左右的姐姐们帮助，却变的更惨。
金光亮宣教士的眼光实在毒辣，我就是个乡巴佬土包子
癞蛤蟆努力靠近人寻求温暖，只得冷漠与厌烦。
但成长必然要有苦难。不是昨天，就是今天。不然就在明天。
没有痛苦，我绝对不会改变。在痛苦中思考，生命由此改变。
上帝的怜悯，不是欺骗，反而是使我得不着欺骗。
2020高神大 27韩国釜山 
去年10月左右得了个单独宿舍，开始了只有吗哪的旷野生活。
一无所有，连萝卜也买不起。拉面也再也吃不起了。
面粉，剩的辣椒粉，油，这是每天的主餐。好的话能有个鸡蛋。
自己一个人生活的几个月中，又病了一次。上吐下泄，一无所有。
极度疼痛，切身的感受到了求死不得的剧痛。叫喊。
还好，只有我一个人，我这痛苦不会影响别人，独属于我的恩典。
好想叫救护车啊。感谢神，又拦阻了我的这一想法。
我一无所有，只有他名可呼喊。
剧痛中的无法入睡，开始拒绝呼吸，直到受不了再呼吸一点。
睡着了竟然。第二天开始熬面汤，奢侈的加个鸡蛋。
放假开始去就近的大学教会。新冠出现又有了正当的理由开学继续去。
终于有次讲道，听到了嘲讽我的恩典。我不再自以为义的奉献。
我活该被嘲讽。一切都是神的，我却自以为我好。神好才对。
神给了嘲讽，神又给了冰箱，神还给了同样生活的室友
下半学期又给了做饭的室友。
当我学会去过吗哪的生活，无法不可不能追求激素的欺骗
脱离了地狱的无底，享受天堂的城墙，神的天国，渐渐明显。
'''}
