#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"晋朝", "start_time_AD":265, "pass_time_AD":420, "story":'''
晋朝分为西晋（Eastern Jin，266年—316年）与东晋（Western Jin，317年—420年）两个时期
266年2月4日，司马炎篡魏，建国号为晋，定都洛阳，史称西晋。280年灭东吴，完成统一。
晋武帝为了巩固皇权，防止政权被外姓攫取，废除了秦汉时代的郡县制，使用西周时期的分封制。
然而诸王统率兵马各据一方，晋武帝死后，诸王为争夺中央权力，内讧不已，绵延16年的内战，史称八王之乱。
晋愍帝迁都长安，316长安被攻破，西晋末代皇帝司马邺投降匈奴，灭西晋灭亡
北方从此进入五胡十六国时期，五大少数民族建立了十六个国家（其实不止16个），史称“五胡乱华”。
317年，晋室南渡，司马睿在建邺建立东晋，东晋曾多次北伐。383年东晋与前秦淝水之战后得到暂时巩固。
420年，刘裕建立宋，东晋灭亡，中国进入南北朝时期。
由于边疆民族带来草原文化，东晋则拥有中原文化及江南文化，双方逐渐展开文化交流或民族融合。
秦汉三国晋统一，晋朝却是中国历史上最烂的朝代。（混，烂。嗯。）
''', "color":"#808080"}
