#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"隋朝", "start_time_AD":581, "pass_time_AD":618, "story":'''
隋朝是中国历史上承南北朝下启唐朝的大一统王朝，是五胡乱华之后汉族在北方重新建立的大一统王朝
因唐朝与隋朝的文化、制度、社会特点一脉相承，故史学家常将两朝合称为隋唐。
581年二月，北周静帝禅让帝位于杨坚，北周覆亡。杨坚定国号为“隋”，定都大兴城（今西安）。
大业元年（605年），隋炀帝即位后，令宇文恺营建东都洛阳，并于大业二年（606年）颁布诏书迁都洛阳。
589年南下灭陈朝，统一中国，结束了自西晋末年以来长达近300年的分裂局面。
隋炀帝在位时期修建了贯通南北的大运河，是中国历史上最大的两个人造工程之一，但因过度消耗国力，引发隋末民变和贵族叛变。
大业十四年（618年）李渊迫使隋恭帝禅让，享国祚38年。619年，皇泰主被迫禅位王世充，隋朝彻底亡。
隋朝尽管只存活了三十多年，和十几年的秦朝一样，都很“短命”，但恰恰是这两个“短命”王朝，完成了中国历史上两次大的统一。
''', "color":"#808080"}
