#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"马丁路德", "start_time_AD":1483, "pass_time":62, "story":'''
双亲敬虔 父亲矿工 刻苦工作 为使他聪明的儿子可以受较高的教育 19岁时 大学专修经院哲学和拉丁文
马丁路德 耳弗特 硕士学位 进修道院 改攻神学 按立神甫 26岁青年 神学界一霸 威登堡教堂门
赎罪券看法 95条钉 万圣节来宾看到传播 借近出印刷术速传各国 即时影响赎罪券停售 路德著书解释95条
摇动教会根基 打击教皇权威和钱包 传票路德 异端魁首 去必死 路德朋友 选侯腓勒德力 要罗马取消传票
老教皇听 教皇发谕 某修士言 异端之说 特使会路德 路德答应 不讲赎罪券事 可写屈服教皇信
教皇友善回信 神圣罗马皇帝死 14月之久 选情占教皇心 同时 路德和反对者 双方不缄默 来比锡之辩
厄尔对路德 巧计对付 路德站队异端胡司 得不到支持 厄尔赴罗马 教皇革籍 呼吁焚路德书 路德示抗
驳敌基督可咒之教谕 1520下半年 路德三书 路德焚教皇谕 教皇求王 皇帝传路德 沃木斯国会 国会王农
请求时间思考 准许24h 路德二次出席 拉丁文讲 德文重复 数次会议 不能达成协议 命回威登堡 不准讲道
路德小门离开 未曾见者 腓勒德力 带至瓦特堡 不受搅扰 写作时光 跟从者激进变革 路德凛然出去恢复秩序
墨兰顿 将路德神学思想系统化 出书 呼吁恢复农民权力 启发改革思想 农民起义 看为路德引起 路德危机
新支持者 对象修女凯瑟琳 丧服反问 上帝未死 路德恢复 农民起义更甚 镇压 死伤十余万 路德先锋 下令镇压
路德改革支持者主要是农民和封建诸候 二者矛盾 路德只能站队诸候 改革已展开 无法抵挡 路德信念如一
自己家乡 因着过度疲劳和心脏病 在围着他的人群中去世 一生勇敢告白依靠基督 离世亦喜乐 年62岁
'''}
