#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"加尔文", "start_time_AD":1509, "pass_time":55, "story":'''
母亲早逝 被送到贵族人家抚养 1523 至巴黎进修 所有学科 努力学习 1533 柯布 万圣节演讲
路得观点 谣传加尔文指导 二人逃命 漂泊化名 秘密教授 1535喘息 全本真理 系统整理 基督教原理
1540 娶富寡妇(31岁) 进入日内瓦 法惹勒见 道出来意 加尔文拒 老先生站直 [锐利眼瞪 教会需时
你拒援助 愿神咒诅 你的进修] 服从请求 谦卑助手 次年讲师 反对党获选 二人不低头 政府驱逐
布塞珥邀加 特拉斯堡 三年平静 学者生活 牧养教会 进修写作 日内瓦乱 劝回母会 舍弃个人不满
再入日内瓦 开始事工 牧养教会 创办学院 1559 基督教原理三版 五倍一版 每天疲劳 至1564
加尔文死 不到55岁 [借着学院 影响广传] 各国改教 派系繁生 
'''}
