#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"古巴比伦王国", "start_time_BC":1894, "pass_time_BC":1595, "story":'''
苏木阿布（BC1894～BC1881)建立古巴比伦第一王朝。BC1595年，赫梯统治者穆尔西里斯一世最后将其灭亡。
公元前18世纪初，古巴比伦王国崛起。在汉谟拉比领导下，一跃成为囊括整个两河流域的帝国。
为了强化统治，汉谟拉比制订了世界上古代的第一部比较完备的成文法典——<汉谟拉比法典>。
《汉莫拉比法典》建立在两个最著名的原则基础上，此即“以眼还眼、以牙还牙”和“让买方小心提防”。
位于亚洲西部，美索不达米亚（底格里斯河和幼发拉底河之间的土地）是世界上最早的文明发源地之一
在犹太人和希腊人的笔下，美索不达米亚是一个人人向往的天堂，《圣经》中的伊甸园就在这里。
不过，在今天的两河流域，气候和自然条件显然已经和犹太人和希腊人的描述大相径庭。
地质学以及环境变迁的研究者们提出了创见性的论断：在距今6000年至4000年时，两河流域存在着湿润而不是干旱的气候。
上述(地质学家测定)成果无可辩驳地证明了，两河流域曾经存在特别湿润的气候。
那时，亚美尼亚山区丰沛的降水源源不断的注入幼发拉底河和底格里斯河，两河流域的又滋润着平原肥沃的土地。
恰恰是在这个气候湿润的关键时期，古代美索不达米亚人创造了人类历史上最古老的文明。
''', "color":"#FFD700"}
