#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"周朝", "start_time_BC":1046, "pass_time_BC":256, "story":'''
中国历史上继商朝之后的第三个王朝。周亦为“华夏”一词的创造者与最初指代。享国共计791年。 
西周由周武王姬发创建，定都镐京（宗周）（今陕西西安西南）；周成王五年，营建都城洛邑（成周）（今河南洛阳）；
公元前770年（周平王元年），平王东迁，定都雒邑（成周）（今河南洛阳），此后周朝的这段时期称为东周。史书又将西周和东周合称为两周。
其中东周时期又称为“春秋战国”，以韩、赵、魏联手打败执政的智氏家族，三家分晋为分水岭，分为“春秋”及“战国”两部分。
以姬为氏，周人嗣其姓”，语言为上古汉语，文字上仍采用古汉字，在民间记事仍以龟骨和牛骨刻字记事为主，王室则以新兴的锦帛等记事为主。
西周采取分封制和宗法制。因为宗法制的分封制，全国领土被分封制联系在一起，诸侯国家与周天子有着一系列复杂的义务-权力关系。
周公及时在东方区域建立政治和军事存在，为日后的迁都奠定了基础。犬戎攻破镐京，周王室东迁，到洛邑继续延续国祚/zuò/。
周公制礼作乐，是周朝国祚绵长的重要原因。制定了一整套的西周的礼乐制度，从天子到庶人都必须遵守。
礼乐制度是周朝统治的文化基础，在平民以上的阶层都形成了一种文化共识，这种共识无疑有利于加强整个国族对于周王朝统治合法性的认同。
周天子并不强大的王权，使得虚君成为可能，也使得任何一个诸侯不会轻易去篡夺中央王权。
西周初年建立的宗法分封制，各个诸侯国有着很大的自主权，这看上去好像是周天子没有强力控制能力
但是实际上这种制度恰好有利于政治的稳定。在周天子强大时，他对诸侯国有很大的约束能力。
''', "color":"#808080"}
