#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"埃及古王国", "start_time_BC":3188, "pass_time_BC":2270, "story":'''
因着洪水导致的地理气候大变动，洪水之后的历史测定，是不准确的。
在诸多说法中，相信圣经的说法。或者神使我相信的是圣经的说法。
在之后的可测历史中，倒是没有什么争议了。但可测历史，太短了。
中国，作为文明的不间断的继承者，也只到公元前2070是可测的。
所以，公元前2070年以前的，都应当看为修改的传说。
BC3150法老美尼斯建立了一个统一的王国。在接下来三千年中，一系列的王朝统治着埃及。
最初的两个统一埃及王朝时期被称为古王国时期，时间约为前2700-2200年。
这一时期内，许多金字塔建成。（洪水之前人有建这些吗？）
石头世纪的建筑，一般都与祭祀太阳神有关，这说明洪水之前的世界，祭祀太阳神是非常普遍的现象
在埃及，洪水之前有亚特兰提斯的传说，位于大西洋的中心，大洪水淹没了亚特兰文明。
洪水之前的地理无法确定。谁也不知道确切怎么回事。只能猜测为一块大陆。
之后人的迁移，当时不发达无法观察，可能那时神直接以大陆带着人移动？一切都是未知。我承认我的无知。
''', "color":"#FFD700"}
