data_dict = {"name":"尼希米", "start_time":3526, "pass_time":19, "story":'''BC444-BC425 亚达薛西 贵族家庭 尼希米 42360人 城墙 52日 亚达薛西20年 
尼希米 犹大来人 惨况 哭泣悲哀 禁食祈祷 酒政愁容 祖坟城荒 王问 默祷 
求差遣 定日期 王喜 求诏书 王允 护送 夜查城 保密 重建 分工作 敌恨嗤笑 
墙高一半 敌怒来攻 工作与兵器 不脱衣 天亮 工作 星现 百姓怨弟兄 尼希米怒 
筹划 斥责 攻击取利者 归还 不再索要 两袖清风 敌计害 工忙不去 52天修完 
城广民稀 日升开 尚守关 按班看守 神感动 家谱计算 7月聚集 请以斯拉 宣读律法 
讲明意思 众民哭 当喜乐 吃肥喝甘 明白教训 大大快乐 住棚 喜乐 禁食 披麻 
蒙灰 离绝外邦 认罪 称颂 述说神作为 祈求 认罪 立约签名 起誓遵行 掣签住圣城 
渐上正轨 回王 祭司结亲 多比雅屋 告假归来 怒抛 净屋 归原用处 利未奔田 
斥责官长 招聚供职 1/10 犯安息日 斥责贵胄 关门 商人外宿 警戒 圣安息日 
外女妻 省长惩诫 污祭司 赶出 洁净 离绝 尽职 守节 '''}
