#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典2016-2018", "start_time_AD":2016, "pass_time_AD":2018, "story":'''
2016大四-以马忤  23鲅鱼圈
大学领毕业证前进入神学，蚂蚁花呗借了钱买火车票回阜阳拿毕业证。我爸又给钱帮我还了蚂蚁花呗。
之后放假前跟着到宣教到自己家，我爸拒绝再给生活费。于是不再要。直到今天（20200919）。
知道要分手便上神学前说了分手，女友不同意便又和好。异地恋的玩笑开了一段时间
最后被分手，示忠起誓，向我主耶稣，然后威胁杀人换来一次接电话，最终还是把卡剪了，手机收了。
暑假在学校里开始过再也没有回家过什么日子直到今天（20200919），
开始的生活，用完了最后一点点钱，陷入了极度的艰难-洗头/洗脸/洗澡/洗衣都用的发的肥皂
只在厕所里洗澡。有人给了我一块肥皂，如同救命的恩典。
能上学能恋爱，都是我爸的钱。被分手陷入艰难，都是我没钱。在这之中，金光亮开始可怜我。
给我牙膏，带我剪头，给我肥皂，给我买衣服，她充满怜悯，可怜一无所有的我，直到今天（20200919）。
其实没钱只是一方面，我还不愿意搞钱，决定了我必然没钱。
但这样的没钱，被所有人抛弃的状态中，上帝感动了金光亮宣教士的心
她可怜我，收纳我，养育我，忍耐我，直到成为今天（20200919）的恩典。
2017以马忤  24鲅鱼圈  被收养的我开始被贴金。由此吸引人，和白如老师乱。
被怜悯的我开始被靠近。由此轻视人，冒犯金光亮妈妈。
神借着权太星爸爸，挥起了教养的杖，我开始害怕，改变。
奴隶成为儿子的过程中，慢慢的学着近且敬的课程。
敬，畏。the Fear of Isaac.
2018以马忤  25鲅鱼圈  上半年学校顶风作案继续干，下半年开始撤，9月份在济州岛举办了毕业典礼。
下半年开始全心准备韩语考试准备签证材料。在这其中，我在哪里，金光亮就照顾到哪里。
金光亮办完了手续，神也赐给了我一张六级的证书。中间住进了权家里一段时间。又写了认罪信。
在离开中国前，神先帮助我清理了我的垃圾。尤其是递认罪性，这真是，全靠圣灵的帮助。神的恩典。
乡巴佬土包子，开始准备留学生活，并不知道所要面临的同学，是何等的上流。自己又是何等的下流。
'''}
