#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典2000-2005", "start_time_AD":2000, "pass_time_AD":2005, "story":'''
2000一年级  7江东村
据说因为特别笨所以上了两年一年级。
有次抽考没抽我，我要了一块钱，买了笔，上了车，被人送了下来。
小时候经常生病。皮肤大病也有。
我爸天天晚上给我擦硫磺膏。
所以他现在才这么爱我吧。他爱他的付出。
小时候经常去前面医生家的垃圾堆里玩。活到现在，都是恩典。
深水里，喊“大强大强”，最后喊出“耶稣救我”事件。
2001一年级  8江东村
2002一-二年级  9江东村
2003二-三年级  10江东村
有次我妈骑车子带我去姥姥家，我腿卡车轮里了不说话。
过会再说了，已经严重伤了。还好她没钱不是机动车。。。
2004三-四年级  11江东村
大概这时候得了个数学什么奖，得了10块钱，我妈不满意让我转学了。
也有是因为马春勤让我天天写版书之故可能。
现在的腰疼可能是因此，现在的思考可能是因此。
神是善意的。他是懒惰的役使小朋友的。
但我不知道他的心，神知道。等候神来说话。
中间还有次数学老师找我去考试的。
开始了第一次的不知所措在上帝面前跪下祈求。
2005四-五年级  12江东村
又转回了江东小学。那个私人学校的一年学习结束了。
可能是锻炼身体的恩典。天天走老远。
'''}
