#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典2012-2015", "start_time_AD":2012, "pass_time_AD":2015, "story":'''
2012高三-大一  19阜阳师范
求爱不得想吸引其关注，毕业照都不去。高中毕业证，无。
然后班主任让我们给他搬家后，给了录取通知书。
放假去买电脑，说了很多乱七八槽的名词，最后“最便宜的”
选了一个3000块的赛扬。然后回去立马搞坏了再修。
假期去了次温州聚会。土包子的自以为是又开始劝勉说些话。
但也没办法。那个无知的年龄。现在也是吧。
遇到了很优秀的室友们。第一次从室友那里品尝到了一次酸奶。
嗯，第一次喝到纯牛奶应该是在高中吧。
现在我可真幸福。牛奶都能天天喝了。
酸奶还嫌弃不健康了。天呐。怎么会成为这样。神奇妙的恩典。
2013大一-大二  20阜阳师范  
又去了次温洲，借老师让拥抱之名义抱何南君。
我总是在圣洁之所行污秽之事。从我心开始。
2014大二-大三  21阜阳师范  
喜欢何南君，喜欢杨洋，喜欢荣容
表白陶广平学姐，被换女朋友的人训，于是换教会。
在宁静谷教会又开始本性不改的骚扰上层熊娟娟。
又是SNS软件的便利让我随时有恶意皆可发。
有次和磐石传道的人握手，忽视了个小的。
过一段时间发现好像熊娟娟把他追到手了。哈哈哈哈～～～
2015大三-大四  22阜阳师范  
中间搬出去过一段时间，学了Jave和Android及网页开发。
但可能因抛弃室友而被室友记恨。后面室长极大的操练了我。
中间有过需要签就业协议的。去找了小学的校长。
然后我签了完成学校任务并不去他那，而是去上神学去了。
我们的可吐槽的地方很多。但不知道神的善意如何
还是不要吐了先。等候神。先信。
'''}
