#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典2009-2011", "start_time_AD":2009, "pass_time_AD":2011, "story":'''
2009初三-高一  16利辛
从小学跑步喘事件到现在的入学跑步，开始暴露。
身体确实不行。不如别人。实验也是不如别人。
入学选择了免费的。但只免费半年。我成绩不好了。
虽然免费的，但同样二本，马恩惠还复读了一年。
我爸不如马恩惠爸能力大，神的恩典更多显。
2010高一-高二  17利辛  继续换人恋。
谁坐我前面我就天天看就天天恋。
室内大声唱歌被赶事件，抛弃周华飞室友事件。
晚上路上被女生叫住被打事件。
随意短信不去上课事件，晚上拤一堆纸事件。
天天没事去黑网吧乱搞。
自己做饭事件，不舍得买路边盒饭的菜。
被人骗偷钱弄了个豆浆机结果电压不给力。
现在也是自己做饭，确是富有无比。
我自己羡慕的程度。也不用豆浆了，天天有牛奶喝。
2011高二-高三  18利辛  
喜欢人的乡巴佬开始自残，希望得对方多看一眼的卑贱。
经常网吧包夜事件。马恩惠饭前谢饭震惊我事件。
在马恩惠面前也，不对，是个女生，我都自卑。
和班主任闹矛盾被回家事件。我爸找歪路事件。
在苏州聚会被班主任叫回事件。
我爸捡了个智能手机立刻扣卡给我用。
诉苦不容易。我的贪心
不对，他的娶妻子生子的贪心压迫他。
'''}
