data_dict = {"name":"扫罗40", "start_time":2919, "pass_time":40, "story":'''40扫罗王 先知证清 雷雨 不弃不断 二年时 吉甲越位 约拿单之勇 蜜 扫罗妒 
百姓救 灭亚玛力之命 扫罗之惜 <耶和华所悦 听命胜于献祭 顺从胜于公羊的脂油> 
悖逆的罪与行邪术的罪相等，顽梗的罪与拜虚神和偶像的罪相同 厌弃与厌弃 求人抬举 
亚甲喜悲 不见先知之悲 耶西众子 <人看外貌 神看内心> 牧童大卫 弹琴 歌利亚 
无畏之信 约拿单盟 千千怒 钉 害 约拿单调和 钉 米甲救 拉玛撒母耳 拿约捉 
逃至约拿单 结盟 三日离席 扫罗怒子 见哭 亚希米勒 逃至亚吉 装疯 逃至亚杜兰洞 
收聚失意人 安置父母 摩押王 祭司灾 以东人多益 救基伊拉 亚比亚他 大卫 
必交 逃离 扫罗寻索 约拿单坚固 西弗出卖 西拉哈玛希罗结 （扫追大 非攻扫 
扫回） 割衣襟 自责 扫罗哭 拉玛葬先知 收富寡妇 西弗再卖 枪和水瓶 投奔亚吉 
16月 备战 扫罗求鬼 洗革拉 大卫夺回 送礼 以色列 战败 扫罗亡 基列雅比 
葬扫罗 杀受膏者 死罪 大卫 哀歌 上希伯仑 大卫王 '''}
