data_dict = {"name":"旷野", "start_time":2523, "pass_time":40, "story":'''绕道 云火柱 追兵怨 红海 水护 水灭 歌唱 玛拉怨 律典 汛怨 鹌鹑 40年吗哪 
水怨 磐石出水 战亚玛力人 岳父 出谋 西奈山 法版 金牛犊 烈怒 恳求 烈怒碎版 
饮罪 亚伦辩 利未杀 舍己赎罪 摘饰候 摩西求 神的荣耀 双版上山 五祭七节 
（燔祭 素祭 平安祭 赎罪祭 赎愆祭） 逾越节 除酵节 初熟节 五旬节 吹角节 
住棚节 赎罪日 双版下山 发光 蒙脸 圣所献 礼物和人 工成祝福 成圣 亚伦献祭 
二子死： <亲近人中显为圣 众民面前得荣耀> <祭司禁宣泄己情 神的膏油在其身> 
利未人 祭司分 食例 人口调查 加底斯 巴尼亚 12探子 击杀 恳求 徘徊 恶信死 
强上败 可拉妒 会众攻击 神怒 亚伦站 亚伦之杖 加低斯 米利巴水 以东拒 
吗哪怨 铜蛇 巴勒 巴兰 <咒诅变祝福 拣选与无罪> 什亭 非尼哈 民数 无仅 
立约书亚 米甸人 报仇 杀巴兰 军长赎命 河东：流便 迦得 玛拿西 摩押之嘱 逃城 讲律法 
证歌 '''}
