data_dict = {"name":"波斯王后以斯帖", "start_time_BC":483, "pass_time_BC":473, "story":'''亚哈随鲁 3年摆筵 请后 不遵 王怒 冷宫旨 怒息念 选后 末底改 哈大沙 以斯帖 
蒙恩 未言籍贯 洁净 挨次见回 除给无求 众悦 王后以斯帖 朝门末底改 遵命以斯帖 
如抚养时 辟探 提列 末底改 哈曼高升 王吩咐拜 惟末底改 日劝不听 告诉 
怒 灭族意 普珥日 求旨捐银 王允赐银 传旨候日 披麻 蒙灰 哭号 王后关怀 
不受 差人见 嘱咐求 王后不易 末底改之信* 王后无畏 嘱咐禁食 照行 朝服 
内院站 王恩金杖 摸杖头 王阔 再筵 哈曼乐 末底改不动 满心怒 立架 王夜听史 
喜悦尊荣* 哈曼行 仍回朝门 蒙头回家 妻言 来催 二筵求命 指证哈曼 王怒走 
伏后榻求 王见 视辱后 人蒙脸 哈曼架* 敌产归后 末底改管 后求除谋 允可旨 
换装改 犹大乐 外入籍 反杀日 官帮 二日杀 十儿木架 只杀不财 记录 信达 
守日 二信嘱劝 宰相为族 以斯帖BC483-BC473 波斯: 古烈 大利乌Ⅰ 亚哈随鲁 
亚达薛西Ⅰ 大利乌Ⅱ 亚达薛西Ⅱ 大利乌Ⅲ '''}
