data_dict = {"name":"约伯记？", "start_time":1970, "pass_time":160, "story":'''
七子三女 七千羊 三千骆驼 五百对牛 五百母驴 许多仆婢 至大 儿按日筵 请姐妹来 筵过父命
清早献祭 常行 有一天 神子侍立 撒旦其中 神问何来 走来走去 往返而来 神夸约伯 撒旦控告
神允限制 撒旦退去 有一天 儿筵日 畜死儿亡 撕衣剃头 伏地下拜 <赤来赤回 神赏神收 神名当颂>
不以神愚 不妄评神 又一天 如前 再夸 再控告 存命命 撒旦退去 击打约伯 脚掌至头顶 毒疮
炉灰中坐 瓦片刮身 妻言伯责 神福神祸 三友来 七日默坐 约伯咒生 愿未生 切望死 以利法责
约伯诉苦 求死 责友 厌命 比勒达责 诉理 伯答真知 奈人无奈 诉神权 人怎言 只恳求 琐法责
约伯说 责友 炉灰箴言 淤泥坚垒 诉求神 以利法责 诉理 伯言 安慰 愁烦 换位之言 诉苦
比勒达责 伯责友责 诉己悲 琐法责 伯说 恶盛为何 以利法责 捏造攻伯 伯诉苦 求见神诉 比勒达责
伯责友 诉苦 智慧之言* 愿如前 诉现惨 证正求听 三人不再答 以利户怒* 责答说 又说 又说 又说
旋风中答 权能之问 创造之问 与神辨者 可回答吧 承认卑贱 不再说 旋风中答 你岂有能 岂能自救
河马鳄鱼 神不欠人 见神恶己 尘灰懊恼 神怒三人 三人献祭 约伯祈祷 神悦纳他 苦境转回 
赏赐加倍 畜×2 人来安慰 送银金 七子三女 女得产业 见四代 日满而死
'''}
