data_dict = {"name":"耶稣", "start_time":3966, "pass_time":34, "story":'''[撒迦利亚 预言约翰 话多哑巴 孕藏五月 六月] 童女孕 见伊利莎白 同住三月回 
[约翰生 父写名 开口称颂 预言] 欲暗休 使者梦显 拯救之名 醒遵娶 末同房 
等生子 伯利恒 回报名 客店满 马槽 诞生 牧人夜守 天使报信 天兵赞美 牧人寻 
话传 赞美神 东方博士 耶城问星 王民不安 召问答 暗召问星 差寻报 听从去 
随引至 进拜献礼 梦示别路 梦显命逃 夜去埃及 希律被愚 怒杀男孩 希律死 
梦显回 听希子继 怕去 梦指加利利 拿撒勒 耶城归礼 西面称颂 亚拿称谢 
回拿撒勒 12岁 耶城守节 未回 父母找 殿遇 回拿撒勒 顺从 成长 旷野约翰 
神的话临 约旦河 约翰施洗 [要结果 多分无 勿多要 当知足] 猜是基督 提鞋不配 
当尽礼 洗礼 灵降声发 旷野 禁食40昼夜 试探 [饿了 石头食物 神的话语 
经文逼神 不可试探 繁荣世界 当拜主神 单事奉他] 魔鬼离开 天使伺候 约翰下监 
退加利利 传福音 呼召门徒 迦拿婚筵 耶路撒冷 神迹 多人信 知道人 不交己于人 
尼哥底母 夜见 谈重生 犹太施洗 约翰恭敬 喜乐满足 叙加 井旁妇人 拿撒勒 
排斥 加百农 12门徒 {西门彼得 安德烈 西庇太子雅各 约翰 腓利 巴多罗买 
多马 税吏马太 亚勒腓子雅各 达太 奋锐党的西门 卖耶稣的加略人犹大} 登山宝训 
制服撒旦 赦罪 医人 始用比喻 听道遵行 母亲弟兄 平静风浪 格拉森 赶群猪亡 
人求离 血漏好 承认 得救 管会堂女 非死乃睡 嗤笑 惊奇 家乡不信 两两差徒 
教导众人 约翰死讯 [责王后恨 后女舞 高兴妄形 后使女 约翰头] 独自退去 
众人跟随 怜悯 医治 喂饱众人 12篮零碎 海面行走 革尼撒勒 医治教导 责废神守人 
心出污人 迦南妇人 医人 饱人 七筐零碎 约拿神迹 门徒防酵 两剂医瞎 信仰告白 
预言苦难复活 彼得劝 耶稣责意 登山变相 赶鬼医孩 再预 纳税事 教导 半千饶恕 
千万赦免 一天一钱 乐意恩典 财主难进 靠钱何等难 三预 二徒求位 十怒 
大用首仆 瞎子求怜 无果枯干 行动为遵 耶路撒冷 投石 退出 比利亚 计算代价 
寻找失物 [百羊丢一 主人心 十钱丢一 爱人心 二子丢一 父亲心 悔改 欢喜快乐] 
犹大 拉撒路 出来 撒该 下来 耶路撒冷 荣入圣城 洁净圣殿 首领欲杀 香膏膏主 
他们气女 主看美事 述说记念 犹大出卖 主洗门徒脚 最后晚餐 彼得自稳 预言不认 
橄榄山 祷告 己意不要 只要神意 门徒睡 警醒祷告 心灵愿意 肉体软弱 亲嘴背叛 
'我就是' 退后倒地 彼得砍耳 [教收刀 父所给杯 岂可不喝] 医好 被绑 
审判 不言 是神儿子 众定死罪 吐唾沫 蒙脸打 一伙 三次否认 鸡叫痛哭 巡抚审 
犹太人王 你说的是 控告不言 [送至希律 不言 众藐视 戏弄 送回 有仇成友] 
双无罪 众人喊除 人要 钉主 鞭打 戏弄 钉十字架 分衣 讥诮 [约翰母亲 全事已成 
尝醋 经话应验 成了 低头 灵魂交神] 死葬 复活 显现40天 恢复彼得 [爱主 
喂养主的小羊 喂养主的羊] 嘱耶城等候 大使命 升天 '''}