#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"中华民国", "start_time_AD":1912, "pass_time_AD":1949, "story":'''
1911年辛亥革命爆发，1912年成立“中华民国”简称“中国”。同时也结束了延续2000多年的皇权统治。
袁世凯曾经改国号为“中华帝国”，总共做了83天皇帝，很快死于民众的唾骂
从此中国不再有皇帝了，但是无形的帝王思想却存在民众心中。
在人类文明史中，「历史时代」的定义是指从有文字发明时起算，在那之前则称为「史前时代」；
而中国文字记载的历史始于商朝，夏商周断代工程耗资千万，历时4年却遭受质疑颇多
夏朝是否存在是存疑的，商朝已经开始君王世袭，周朝建立完备的封建社会制度至东周逐渐解构
秦朝统一各国政治和许多民间分歧的文字和丈量制度，并建立中央集权政治。
自汉朝起则以文官主治国家直至清朝。清末，以民主共和思想推翻帝制成立中华民国。
''', "color":"#808080"}
