#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"中华人民共和国", "start_time_AD":1949, "pass_time_AD":2021, "story":'''
中国历史按照5000年计算那么就要把三皇五帝等神话纳入了。
根据经过4年匆匆结题的“夏商周断代工程”结论，夏朝应是公元前2070年～公元前1600年
商朝是公元前1600年～公元前1046年，西周是公元前1046年～公元前771年。当然夏商周断代工程有人讽刺是“系统性编造历史”。
一直以来，夏商周的起讫年代以夏朝“约前2146～1675年”，商朝“约前1675～1029年” ，西周“约前1029～771年”出现在史料上。
但根据“夏商周断代工程”的结论则是BC2070的数据。然而，夏朝是否存在过都有争议。
事实上朝代更迭，王朝通常不会如此顺利地过渡到另一个王朝，执政权经常不会立即转移，因而会有时间重叠。
因为朝代往往是在推翻现存统治之前建立起来的，或者是在被打败之后持续了一段时间。
就像清朝建立于1636年（如果从后金开始算是1616年），明朝正统灭于1644年，而最后一个南明的政权直到1683年才被废。
这种统治的变化是混乱而漫长的事情，清政府用了将近二十年的时间来扩大对全中国的控制。
因此，假设中国在1644年突然发生了一次变化是不准确的。
中国历史究竟是几千年？中国有确切依据的信史自商朝算起约有3600年，自夏朝算起约有4000年，因此中国人常说的5000年历史是存疑的。
http://114.xixik.com/chaodai/
''', "color":"#808080"}
