#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"千囍年的未知", "start_time":6000, "pass_time":1000, "story":'''
第六天未，白马骑士，诚信真实，名为神之道，白马众军，利剑击杀，治理列国（旧阶级落下）
万王之王，万主之主，鸟赴神筵，聚集争战，兽被捉拿，封印无底坑千年（毁灭一切外在力量，回归神造的自然）
殉道者，未拜兽及其像者，未受其印记者，复活同作王一千年（新阶级上升），第七天开始
千年完，撒旦被释放，迷惑列国（千年之久，发现封印，人权至上，恢复力量，革命对抗），גּוֹג וּמָגוֹג
上来围城，火降烧灭，被扔硫磺火湖，直到永永远远（最终失败，人类史完）（七日的头一日开始主的历史）
白色宝座，天地逃避，死人复活，按行受审，没记在生命册上，被扔火湖（第一次复活的都是王，是审判者）
新天新地，新耶路撒冷，从天而降，神人同住，以前不再，一切更新。神为父神，羔羊婚娶

{不义仍旧，污秽不变；为义仍旧，圣洁依然；赏罚在主，报应所行；为初为终，唯有唯一；主必快来}
'''}
