#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"埃及喜克索斯政权", "start_time_BC":1720, "pass_time_BC":1570, "story":'''
喜克索斯人于前1650年征服了大多数下埃及地区，并建立了一个新的首都阿瓦里斯。
由雅赫摩斯一世领导的上埃及军队将喜克索斯人赶走，建立了第十八王朝。他将首都从孟菲斯迁往底比斯。
之前不知在哪看的资料，这是在维基百科上看的“古埃及”，不一样。年代都不一样。
重新查找是因为本段时间按之前的资料是在约瑟进入埃及之后了，对不上，于是重新研究
十四王朝时政权又开始瓦解，“第二中间期”开始，此时期埃及第一次遭到外族的侵略
侵略者为驾车作战的西克索斯人，他们占领埃及北部的大部分地区，建立长达100多年的“太阳神不在的统治”
（这个时间是对的上的了。大概在外族统治埃及的第四十年，约瑟这个外族被统治者召见重用。）
''', "color":"#FFD700"}
