data_dict = {"name":"大卫", "start_time":2959, "pass_time":40, "story":'''见基列雅比人 犹大王90月 亚撒黑之悲 帕铁之悲 押尼珥之悲 王举哀 临门二子罪 
33年 以色列王 攻占耶路撒冷 推罗王 希兰示好 利乏音谷战 乌撒触约柜 俄别以东福 
大卫移柜 献祭跳舞 米甲讽* 建殿意 征胜 秉公行义 洗巴 米非波设 亚扪王 
哈嫩辱使 败亚扪 <安乐 大卫王 忧患 乌利亚> 王召 款待 杀夫 夺妻 甚不喜悦 
拿单之喻 除罪 惩罚 禁食 吃饭 所罗门 耶底底亚 占拉巴 役亚扪 暗嫩 他玛 
约拿达 完事 甚恨 赶逐 押沙龙 二年忍 大卫只怒 自己动手 逃 三年 大卫心 
约押意 押沙龙回 拉拢人心 子叛 父逃 洗巴迎 示每骂 大卫心 大卫过河 巴西莱 
备战 王从兵 嘱咐 胜 押沙龙之悲 二信使 答非所问 耿直 王哀 民愧 王出安慰 
请王回 铙示每 洗巴 米非波设 均分地土 金罕 以色列人 示巴 犹大人 冷宫怨 
亚玛撒逾期 亚比筛追示巴 约押杀亚玛撒 妇人救城 完事回家 三年干旱 扫罗热心 
基遍人 悬挂七人 利斯巴守护 大卫葬骨 王危 跟随者之志 大卫诗歌 勇士故事 
数民罪 降灾 怜悯 亚劳拿禾场 献祭 垂听 灾停 王年迈 亚比煞 未近 亚多尼雅 
约押 亚比亚他 拿单 拔示巴 '''}