#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"宋朝", "start_time_AD":960, "pass_time_AD":1129, "story":'''
宋朝是中国历史上承五代十国下启元朝的朝代，分北宋和南宋两个阶段，亦称“赵宋”。
为了区别于王室赵构在靖康之难后在江南重建的宋政权，之前的被后世称之为“北宋”。
1125年金国大举南侵，1127年洗劫国都开封掠走徽宗钦宗二帝及后妃王子公主大臣，史称“靖康之难”，北宋灭亡。
公元1127年，金国从开封撤军以后，立宋朝太宰张邦昌为帝建立傀儡政权“大楚”，史称“伪楚”（“张楚”）。
由于北宋军民的反对，“伪楚”仅存在了短短一个月的时间。伪楚政权存在时间虽短，但其的出现却是两宋交替的重要事件。
1127年五月一日，康王赵构于南京应天府（今河南商丘）登基继承皇位，重建宋王朝，史称“南宋”
（然后和金/蒙古/元等战争）1279年，崖山海战后，8岁的小皇帝赵昺被大臣陆秀夫背着跳海而死，南宋灭
''', "color":"#808080"}
