#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"战国", "start_time_BC":475, "pass_time_BC":221, "story":'''
以三家分晋的结果为标志，奠定了战国七雄的格局。齐国、楚国、燕国、韩国、赵国、魏国、秦国。
秦国在春秋末期是力量较弱的国家之一，所以秦统治者一直力图改变这种局面。魏国人商鞅应暮入秦，自此，秦国进入了其快速发展的阶段。
商鞅的变法遭到了其他旧势力的反对，至秦惠王即位，商鞅便被施以车裂之刑，而他所设立的新法却广泛被秦人接受
魏国与韩国相同，也是由晋分裂出的国家之一，并且在三个国家之中实力较强
齐国以田忌为大将、孙膑为军师以“增兵减灶”之计在马陵之战中彻底击败了魏国，使魏国从此一蹶不振
孙膑曾与庞涓为同窗，二人一同拜师学习兵法。庞涓后来出仕魏国，担任了魏惠王的将军，但是他认为自己的才能比不上孙膑，于是暗地派人将孙膑请到魏国加以监视。
孙膑到魏国后，庞涓嫉妒他的才能，于是捏造罪名将孙膑处以膑刑和黥刑，砍去了孙膑的双足并在他脸上刺字，想使他埋没于世不为人知。
当齐国使者出使至魏国首都大梁（今河南省开封市）时，孙膑以刑徒的身份秘密拜见齐国使者，用言辞打动了他。
逃奔到齐国的孙膑得到了田忌的赏识，于是他寄居于田忌门下担任门客。
战国后期，赵国因有名相蔺相如、大将廉颇等大臣忠心为国，使赵国颇为强大。
秦大将白起用离间计使赵王弃用廉颇而用赵括为将，才于长平击败赵军，杀其士卒达四十万。
燕国原是北方的一个小国，至燕太子丹的时代，因见秦国强大，早晚会对燕国的统治不利，于是谴刺客荆轲刺杀秦王
不料，荆轲被秦王斩于殿上。太子丹行刺未果，反而使秦王对燕深恨不已
战国时期虽连年征战，但这丝毫未影响中国古代文化的发展。此间，中国古代思想文化达到了有史以来的第一个高峰
其中以孔孟为代表的儒家；老子、庄子、列子为代表的道家；韩非为代表的法家；墨子为代表的墨家等理论最为后人推崇。
公元前230年，秦王赢政开始了他统一全国的征程，秦先后消灭韩、赵、魏、楚、燕、齐六国，并于221年统一了全国。
''', "color":"#808080"}
