#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"清朝", "start_time_AD":1616, "pass_time_AD":1912, "story":'''
清朝又称大清（鞑清，满清），简称清，是中国历史上最后一个封建王朝
清朝政治显尊奴才化，对内文化的禁锢文字狱，对外实行闭关锁国的政策
1644年李自成率大顺军攻占明朝国都北京。一片石之战后，多尔衮率清军趁势入关，逐步掌握全国。
1840年爆发了中英鸦片战争，多遭列强入侵，主权和领土严重丧失。前后共有27块租界。
1900年的夏天，八国联军为了镇压义和团运动维护在华利益侵略中国。清朝沦为半殖民地半封建社会。
1911年，辛亥革命爆发，清朝统治瓦解，1912年2月12日，清帝被迫退位。
满清封建制度的落后性和封闭性，闭关自守，不思进取，让中国落后于世界。
所以在其末期，孙中山的中国同盟会曾以“驱逐鞑虏、恢复中华”为政治纲领号召人民推翻满清政府。
清朝统治者统一蒙古诸部，将新疆和西藏纳入版图，积极维护国家领土主权的完整，奠定了今日中国之版图。
乾隆年间，中国作为统一的多民族世界大国的格局最终确定。
''', "color":"#808080"}
