#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"秦朝", "start_time_BC":221, "pass_time_BC":207, "story":'''
嬴政灭六国，统一中国，称始皇帝，是秦王朝的开国皇帝。秦朝王室嬴姓，故史书上别称嬴秦，以别于其他国号为秦的政权。
公元前207年，秦王子婴向刘邦投降，秦朝灭亡，国祚共十五年。
秦国原是周朝的一个诸侯国，其始祖伯益曾辅助大禹治水有功，被帝舜赐了嬴姓。
伯益的后人非子曾为周孝王养马，凭着他的本事，马繁殖得很快。周孝王于是把秦谷一带分封给他，这就是“秦”的起源。
公元前770年，秦襄公护送周平王东迁至雒邑有功，被封为诸侯，秦始建国，接收周朝在关中的领地。
秦朝结束了自春秋起五百年来诸侯分裂割据的局面，推行车同轨、书同文、行同伦统一文化风俗，加强了大一统的凝聚力
秦始皇死后秦二世胡亥与赵高合谋篡改秦法导致秦末农民起义。各地纷纷响应，其中属项羽和刘邦领导的两支军力最强。
郡县制的主要意义在于废除分封制，加强了中央集权，实现了多民族国家的大一统。
但其意义不主要在于它的本身，更在于它实行后相对之带来的其它的政治、经济和文化制度。
''', "color":"#808080"}
