#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"夏朝", "start_time_BC":2070, "pass_time_BC":1600, "story":'''
夏部落首领禹因治水有功，得到了虞(/yú/)舜的重用并最终将部落联盟首领之位禅让于他，是夏王朝的开端。
禹收九洲，金铸九鼎，以显其功绩及威信权力。禹之子启，承袭父位，中华历史第一个家天下的王朝－夏朝。
启之子太康也治国无方，当政期间更是战乱纷纷，最后被东夷的后羿夺取了统治权，史称“太康失国”。
后羿与太康相同，也是一个无能的统治者，终日沉溺于游猎之中，将政事完全交与寒浞手中。寒浞掌权后，杀后羿而代之，自立为王。（原来这样，然后神化自己像是宁录）
孔甲执政，夏朝开始走向了衰亡。孔甲“好方鬼神，事淫乱”，引起人民的不满和诸侯的叛乱。
夏朝的最后一个国王夏桀，是历史上一个有名的暴君。黄河下游的一个夷人部落——商在其首领成汤的领导下兴盛起来。
成汤以讨伐暴君夏桀为名，发动了灭夏的战争；夏桀兵败，死于南巢（今安徽寿县），夏朝宣告灭亡。
近年来，通过对夏都遗址的考古工作及“夏商周断代工程”的研究，使我们对夏代的政治、经济及文化等方面的发展又有了新的认识。
''', "color":"#808080"}
