#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典1994-1999", "start_time_AD":1994, "pass_time_AD":1999, "story":'''
19940907周三  1江环寨
神借着江伟张丽赐下生命的恩典。生命身体，用到了今天。
1995  2江环寨
据说没奶喝，所说从小吃我爸嚼过的面条。
1996  3江环寨
小时候被爸妈关在屋里哭累了自己玩，被妈抛下在地上打滚哭看着她走远起来自己玩
之类的事件是这时的还是稍大的？不合她心意就打我应该是到初中截止。
大部分的我的问题是在这一阶段形成的可能。
1997  4江环寨
可能在5岁左右？反正小孩子时，上学了吗？忘了。填个坑记事件：
同村大哥哥们躲屋里看电影不带我们看，于是我们扒门缝看。
男人，女人，一根管子好长。自此后经常梦到路边裸女。这是根源。
小孩子的吸收方式是不加分辨的直接大脑神经元录制。
1998  5江环寨
1999  6江环寨
可能在六岁左右吧，和同村小姑娘玩男女游戏，说另一个大哥哥抱起她怎样怎样弄。
长大后的某天，大概都24了吧，看性侵文章时，不知怎么的想起了这个事件
才知道，性侵原来那么普遍。就在身边。从小身边。
'''}
