#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"波斯", "start_time_BC":553, "pass_time_BC":331, "story":'''
波斯(伊朗古名)，是伊朗在欧洲的古希腊语和拉丁语的旧称译音。波斯兴起于伊朗高原的西南部
BC600年开始，希腊人把这一地区叫做“波斯”。埃兰是波斯地区最古老的文化之一，BC639年被新亚述帝国所灭。
米底（前678年～前553年）是一个以古波斯地区为中心的王国。亚述入侵，促使米底各部落联合，形成了米底王国
BC559，居鲁士大帝统一古波斯部落，建立阿契美尼德王朝。BC553年居鲁士大帝起兵叛变，550年击败米底王国
波斯第一帝国。公元前539年，居鲁士大帝武力入侵征服在美索不达米亚的迦勒底帝国的首都巴比伦
每当夜幕降临，居鲁士就会派遣一些战斗力不强的部队去北面的河床边上挖掘新的壕沟。
其中一条最大的成为了泄洪的引水渠，将幼发拉底河的河水都向着附近的一大片沼泽地引。护城河的水位正在缓慢下降。
不久巴比伦城的宗教节日来临。在守军和市民在美食和酒精的帮助下进入欢乐不眠夜的时，波斯军队打通了壕沟与幼发拉底河的河道。
对国王多有不满的巴比伦祭祀阶层，开始发挥第五纵队效果。他们首先显出了自己的马尔杜克神庙，接着从里面打开了王宫大门。
居鲁士占领巴比伦后，马上和城内的祭祀达成了共识，将那波尼德曾经怠慢多年的巴比伦主神马尔杜克再次扶正。
……居鲁士又开始分配不同民族的军队到当地驻守。巴比伦城内的犹太人，开始映入他的眼帘。
奴役他们的巴比伦王权被摧毁，他们也成为了波斯人统治帝国的重要棋子。居鲁士解除了对他们的囚禁，让他们全部返回故土定居。
这些犹太人在新的大王政令下，开始重建圣殿与耶路撒冷，并压制了留守当地的本土犹太人后裔，成为了圣地的实际控制者。
在2000多年后的今天，他们的后代同居鲁士大帝的后裔，势如水火。。。。
冈比西斯二世时代（前529—前522年）则最终于前525年征服古埃及后王朝。大流士一世时期，帝国疆域空前发展。
大流士在前521年挥军东征印度河平原，西面则出兵多瑙河三角洲、色雷斯、马其顿王国、古希腊，
但却因马拉松战役（前490年）之失利而败。其子薛西斯一世（前480年）再度对希腊用兵，可惜最终未竟全功。
古风时代——雅典和斯巴达强盛 => 波斯来攻，全力抗争——希波战争 BC499 希腊城邦起义 雅典支持
大流士I 镇压起义 欲攻雅典 BC490 波斯西侵 马拉松战败 BC480 薛西斯I 再攻希腊 希腊合力御敌
海军雅典 陆军斯巴达 温泉关战败 300斯巴达勇士 波斯焚雅典，海军却败 补给危险，撤退 希腊胜
希腊内战——伯罗奔尼撒战争 不满雅典霸权之战 斯巴达成希腊新霸主 好景不长，各城邦继续混战
BC336 马其顿 亚历山大继位 统一希腊 BC334 亚历山大东征 大流士III求和 拒绝 BC331 高加米拉战役
''', "color":"#FFD700"}
