#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"三国", "start_time_AD":220, "pass_time_AD":280, "story":'''
184年汉灵帝时期爆发黄巾之乱，为了平息叛乱、安定地方，各地刺史、州牧被授权总揽地方军政大权，成就了军阀割据的基础。
189年汉灵帝死后，朝廷因宦官与大将军何进冲突引发内乱而被军阀董卓控制。
董卓实施暴政，废立皇帝，各地诸侯军阀借此举兵反抗董卓。赤壁之战时，曹操被孙刘联军击败，奠定了三国鼎立的雏型。
220年, 曹丕逼汉献帝禅让（篡汉称帝），国号“魏”，定都洛阳，史称曹魏，三国历史正式开始。
221年，刘备在成都称帝，为延续汉朝，以及自己政权合法性国号仍沿用“汉”，后世称之为蜀汉、季汉、简称蜀，蜀汉势力最为弱小
229年，孙权正式称帝，建立孙氏政权，国号为“吴”，因其姓孙，故称孙吴，又因其控制扬州、交州、荆州等江东地区，又称为东吴。
此后的数十年内，蜀汉诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。曹魏后期的实权渐渐被司马懿掌控。
263年，曹魏的司马昭发动魏灭蜀之战，蜀汉灭亡。咸熙二年（265年）曹奂禅位于司马炎，建国号为“晋”，史称西晋。
公元280年，西晋灭东吴，统一中国，至此三国时期结束，进入晋朝时期。往往将184年到220年的时间纳入三国时期加以讨论。
在小说家的笔下三国时代波澜壮阔，充满生机，群雄并起，天下纷争，无数的军师和猛将涌现而出，建国立业。然而战争年代没有美好的事情。
当时最为繁华的洛阳和长安城已经接近毁灭，就连汉献帝都差一点被饿死在路上。
东汉5000万人口，到了三国只剩下800万，5000万人死了七分之六，瘟疫，天灾，战乱才是三国的真实写照。
三国为何那么出名？罗贯中的《三国演义》加了很多的虚构内容，把三国神话了。温酒斩华雄斩的是孙坚 没桃园三结义 给关羽刮骨疗伤的人不是华佗等等。。。
为什么三国时代是被改编成游戏最多的题材？这与罗贯中的著作《三国演义》有关。
''', "color":"#808080"}
