data_dict = {"name":"使徒时代", "start_time":4000, "pass_time":69, "story":'''
回耶城 摇签马提亚 五旬节 圣灵降临 赐方言 彼得证道 受洗三千 奇事神迹 
凡物公用 金银皆无 耶稣之名 起来行走 彼得证道 因着耶稣 他是救主 五千信 
公会查问 耶稣之名 禁奉此名 听神合理 恐吓 释放 述会友 诉求神 圣灵充满 
放胆讲道 巴拿巴 卖地奉银 亚拿尼亚 撒非喇 欺哄圣灵 仆倒断气 信徒极增 
公会忌恨 收监使徒 释放门徒 进殿讲道 欲提不见 去殿带来 证主 公会怒 
迦玛列言史 打禁释放 欢喜 不住证主 撇道理食 不合宜 大众喜悦 七执事 
司提反 恩惠能力 捉拿 假见证 申诉 责以人 众人极怒 圣灵充满 看见诉说 
捂耳 推城外 石头打 呼吁 祈求 扫罗亦悦 耶城教会 大遭逼迫 分散 各处传道 
腓利 撒玛利亚 古实太监 扫罗 大马士革 大光仆倒 指示 起看不见 拉手领 
三日 不能看见 不吃不喝 亚拿尼亚 主指示 扫罗看见 受洗 吃饭 传道 犹太人议杀 
夜墙缒逃 至耶城 众怕 巴拿巴接待 领见使徒 放胆传道 有人想杀 送下凯撒利亚 
打发去大数 彼得 周流四方 吕大医人 约帕复活 哥尼流 敬畏神 多周济 常祷告 
异象指示 彼得异象 同去 讲道 受圣灵 施洗 上耶城 割礼辩 彼得报告 众人荣神 
神恩外邦 安提阿 希腊人得听 信主人多 传耶城 差巴拿巴 至安提阿 大数找扫罗 
带安提阿 一年 聚集 教训 称基督徒 饥荒 量力捐钱 托巴扫送 希律 杀雅各 
囚彼得 前夜主救 杀看守 讲声如神 不荣神 虫咬死 巴扫带可回 巴扫奉差 
又名保罗 宣教旅行 1宣 2年 别加马可离 加拉太 耶路撒冷会议 律法 不是 
[加拉太书] 2宣看望 [马可争分 西拉 提摩太 帖前后] 3年 马其顿 亚该亚 
希腊 3宣 [林前后 罗马书] 4年 亚细亚 审判 腓利斯 非斯都 亚基帕 第1次入狱 
[以弗所书 歌罗西书 腓立比书 腓利门书] 释放 [提前 提多] 第2次入狱 [提后] 
扩张 35 保罗悔改 57春天 罗马书 64 罗马城大火 纵火者尼禄 转移仇恨 嫁祸基督徒 
大遭逼迫 彼得后书 70 罗马提多 攻毁耶路撒冷 100 以弗所地区 约翰死 使徒时代止 '''}
