#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"元朝", "start_time_AD":1206, "pass_time_AD":1368, "story":'''
元朝是中国历史上第一个由少数民族（蒙古族）建立的统一的封建王朝，定都大都（今北京）
1206年，成吉思汗铁木真统一漠北建立蒙古帝国后开始对外扩张，取得了中国华北地区和黄土高原地区。
同一时间，大蒙古国在西方不断扩张，先后发动三次西征，形成了称霸欧亚大陆的国家，被欧洲称为蒙古帝国（Mongol Empire）。
蒙哥汗去世后，引发了阿里不哥（拖雷第七子）与忽必烈（拖雷第四子）的汗位之争。
1260年忽必烈即汗位，宣布即蒙古大汗位，是为薛禅汗，汉文称为元世祖。建元“中统”，意即“中原正统”。
最后忽必烈于1264年获胜，而蒙古帝国也宣告分裂，促使蒙古四大汗国先后自立。
忽必烈对于“蒙古大汗”称号的继承也没有得到蒙古诸部的一致承认。
元惠宗于七月二十八日，徐达率军攻陷元朝的首都元大都（北京），元作为一个全国性质的统治结束。
''', "color":"#808080"}
