#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"唐朝", "start_time_AD":618, "pass_time_AD":907, "story":'''
唐朝是继隋朝之后的大一统王朝，享国祚二百八十九年，因皇室姓李，故又称为李唐，是公认的中国最强盛的时代之一。
隋恭帝杨侑“禅让”帝位后李渊便以“唐”为国号称帝，依旧定都长安。“唐”曾是晋的古地名。
“玄武门之变”后其次子李世民继位后开创“贞观之治”，是为唐太宗。
武则天以周代唐，定都洛阳，史称武周。神龙革命后恢复大唐国号，继续李氏江山。
904年朱温胁迫唐昭宗迁都洛阳，长安从此失去了王气再也没成为任何朝代的国度。
907年，朱温篡唐，唐朝覆亡，中国进入五代十国天下纷争乱世。
唐朝是版图最大亦是唯一未修建长城的大一统中原王朝。唐代国土在西部及北部皆超出现代中国的疆界范围。
唐朝自攻灭东突厥、薛延陀后，天子被四夷各族尊为天可汗，周边属国在其政治体制与社会文化等方面都受到唐朝的很大影响。
唐朝与阿拉伯帝国是当时世界上最强盛的帝国，声誉远扬海外，与亚欧国家均有往来。
唐朝以后海外多称中国人为唐人，固华人聚居的地方称之为“唐人街”。
''', "color":"#808080"}
