#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"恩典2006-2008", "start_time_AD":2006, "pass_time_AD":2008, "story":'''
2006五年级-初一  13纪王场中学
因马恩惠在那我妈就选了那。也因她进了刘东河班。
第一次英语课被抽脸，第一次电脑课不会关机。
小学数学的骄傲带到初中。不服找老师受教育。
农村来的土包子，从这时，开始了自卑的人生之始。
2007初一-初二  14纪王场中学
生病，我妈带着我到处找医生事件。
生病，天天中午来回学校-医生家跑。还没水喝导致病加剧事件。
弄坏了王芳的一个本子，赔了，钱不够吃饭了。
一周中午天天疯狂骑车回家吃面条再回学校事件。
雨里骑车/坟地骑车/骑铁轮子/泥里拉车/弃车回家……
2008初二-初三  15纪王场中学
情窦初开坐其后天天看，女方换班级，男方换人恋。
经济危机，和纪茵同走，自卑不敢提自己家工作事件。
农村和镇上的姑娘尴尬相处事件，讨厌的小乡巴佬。
乡巴佬一出乡，就开始自卑。这是必然。确实卑。
江卑同学。还反咬帮自己的刘东河老师。尊敬垃圾人。
'''}
