#start_time为AA制开始时间，可换为start_time_BC/AD制开始时间。
#pass_time为经过的时间段，可换为pass_time_BC/AD制的结束时间
data_dict = {"name":"春秋", "start_time_BC":770, "pass_time_BC":476, "story":'''
东周时期又称春秋，是中国历史上的第一次全国性大分裂形成的时期。以“三家分晋”作为春秋时代的结束和战国时代的开始。
公元前七七零年平王东迁，建立了东周王朝。但此时周已衰弱到了极点，统治范围方圆不足六百里
各诸侯国纷纷割据称雄，不再朝见周王，其统率诸侯的权利也是名存实亡。
此间，全国共分为一百四十多个大小诸侯国，而其中以楚国、齐国、晋国、吴国、越国、秦国为大。
楚国是三苗人在长江中下游建立起的一个国家，它在周初曾参加了武王发纣的战争，后得到周的封号，居楚地丹阳（今湖北姊归县）。
齐国的祖先是周文王的谋臣姜尚之族，姜尚因助周灭商有功被封为齐侯（乱七八槽的神话，让我历史都学不正常。。。）
春秋年间，齐国出现了一位历史上著名的政治家——齐桓公。他依靠谋士管仲整顿国政
晋国原处于戎狄游牧地区，东周初期，晋献公（前676年-前651年）建都绛（山西翼城县），开始了晋国的霸业。
到了春秋后期，晋国的统治出现危机，并最终分裂成韩、赵、魏等几个独立的诸侯国家，史称“三家分晋”。
越国与吴国相同，都是楚的属国，但越的兴起比吴还要晚一些，直至允常执政时期，越主才始称为王。
在几大强国中，秦国并不是最强大的国家，但凭借优越的地理位置，秦成为春秋时期发展最快的国家。
但秦国地处中原之北，与戎狄、羌等北方诸族混居，故华夏诸侯一直以秦为戎狄国，禁止其会盟中原
而这却给了秦一个良好的发展机会，到后来战国时期，秦才能以强大的实力消灭六国统一天下。
到春秋末年，大部分中小国家以逐渐退出历史舞台，取而代之的是秦、楚、燕、韩、赵、魏、齐七国统治的的时代。
''', "color":"#808080"}
